app/controllers/api/projects_controller.rb

  def create
    @project = Project.new(project_params)
    if @project.save
---
INSERT INTO "projects" ("title", "description", "workspace_id", "owner_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "sdfdsa"], ["description", ""], ["workspace_id", 382], ["owner_id", 1], ["created_at", "2015-08-30 03:55:26.170966"], ["updated_at", "2015-08-30 03:55:26.170966"]]

  def update
    @project = Project.find(params[:id])
    if @project.update_attributes(project_params)
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", 50]]
UPDATE "projects" SET "title" = $1, "updated_at" = $2 WHERE "projects"."id" = $3  [["title", "Project 1 - fasdkfjasdklfaklf jflakjf klsjklsdj klsdjfslkdjfaklsfjaklsjfasdklfjsad"], ["updated_at", "2015-09-02 16:56:56.182711"], ["id", 50]]

  def destroy
    @project = Project.find(params[:id])
    @project.destroy if @project
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", 47]]
DELETE FROM "projects" WHERE "projects"."id" = $1  [["id", 47]]