app/controllers/api/tasks_controller.rb

  def create
    @task = Task.new(task_params)
    if @task.save
---
INSERT INTO "tasks" ("due_date", "project_id", "title", "creator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["due_date", "2015-07-03"], ["project_id", 47], ["title", "fadffa"], ["creator_id", 1], ["created_at", "2015-08-30 02:22:02.029276"], ["updated_at", "2015-08-30 02:22:02.029276"]]

  def update
    @task = Task.find(params[:id])
    if @task.update_attributes(task_params)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT 1  [["id", 118]]
UPDATE "tasks" SET "due_date" = $1, "created_at" = $2, "updated_at" = $3 WHERE "tasks"."id" = $4  [["due_date", "2015-09-24"], ["created_at", "2015-08-30 02:21:02.789000"], ["updated_at", "2015-08-30 02:21:02.789000"], ["id", 118]]

  def destroy
    @task = Task.find(params[:id])
    @task.destroy if @task
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT 1  [["id", 122]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 122]]