app/controllers/api/users_controller.rb

  def index
    @users = User.where(email: params[:emails])
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'patelv1991@gmail.com'

  def show
    @user = User.find(params[:id])
    @projects = @user.projects.includes(:tasks).where({
      workspace_id: params[:workspace_id]
    })
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "projects".* FROM "projects" INNER JOIN "workspaces" ON "projects"."workspace_id" = "workspaces"."id" INNER JOIN "user_workspaces" ON "workspaces"."id" = "user_workspaces"."workspace_id" WHERE "user_workspaces"."user_id" = $1 AND "projects"."workspace_id" = $2  [["user_id", 1], ["workspace_id", 382]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" IN (47)