app/controllers/api/workspaces_controller.rb

  def create
    @workspace = current_user.workspaces.new(workspace_params)
    if @workspace.save
---
INSERT INTO "user_workspaces" ("workspace_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["workspace_id", 411], ["user_id", 22], ["created_at", "2015-09-04 20:26:40.693516"], ["updated_at", "2015-09-04 20:26:40.693516"]]
INSERT INTO "workspaces" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Workspace 1"], ["created_at", "2015-09-04 20:26:40.503431"], ["updated_at", "2015-09-04 20:26:40.503431"]]

  def show
    # this can be optimized using joins
    # w = current_user.workspaces.includes(projects: :tasks).where(tasks: {assignee_id: current_user.id})
    # w = current_user.workspaces.includes(projects: :tasks).where("workspaces.id = ?", params[:id]).where(tasks: {assignee_id: 1})
    # above two lines return workspace. Need to get projects and tasks from that.
    # But, this time, it doesn't go back to database.
    # w.map {|space| space.projects.map(&:tasks)}.flatten


    workspaces = current_user.workspaces.includes(:users, projects: :tasks)

    if workspaces.where(id: params[:id]).exists?
---
SELECT  "workspaces".* FROM "workspaces" INNER JOIN "user_workspaces" ON "workspaces"."id" = "user_workspaces"."workspace_id" WHERE "user_workspaces"."user_id" = $1 AND "workspaces"."id" = $2 LIMIT 1  [["user_id", 1], ["id", 382]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" IN (47)
SELECT "user_workspaces".* FROM "user_workspaces" WHERE "user_workspaces"."workspace_id" IN (382)
SELECT "users".* FROM "users" WHERE "users"."id" IN (21, 11, 19, 17, 15, 18, 10, 5, 1, 2, 12, 16, 14)
SELECT  1 AS one FROM "workspaces" LEFT OUTER JOIN "user_workspaces" "user_workspaces_workspaces_join" ON "user_workspaces_workspaces_join"."workspace_id" = "workspaces"."id" LEFT OUTER JOIN "users" ON "users"."id" = "user_workspaces_workspaces_join"."user_id" LEFT OUTER JOIN "projects" ON "projects"."workspace_id" = "workspaces"."id" LEFT OUTER JOIN "tasks" ON "tasks"."project_id" = "projects"."id" INNER JOIN "user_workspaces" ON "workspaces"."id" = "user_workspaces"."workspace_id" WHERE "user_workspaces"."user_id" = $1 AND "workspaces"."id" = $2 LIMIT 1  [["user_id", 1], ["id", 2]]