app/views/api/workspaces/show.json.jbuilder


json.my_tasks @workspace.projects.map(&:tasks).flatten.sort_by(&:due_date) do |task|
---
SELECT "projects".* FROM "projects" WHERE "projects"."workspace_id" IN (2)
SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" IN (3, 5)