app/views/api/users/show.json.jbuilder


json.tasks @projects.map(&:tasks).flatten do |task|
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" IN (47)