app/views/api/projects/show.json.jbuilder


json.tasks @project.tasks.each do |task|
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = $1  [["project_id", 47]]